#include <iostream>
using namespace std;
/* 
Задача 2. Съставете схема на управление и успоредно на нея – програмен текст на търсене в масив дотогава, 
докато си намери търсената стойност, при използване на „котва“.
Сами съобразете какъв е цикълът и какво трябва да се направи,
за да се разбере, след излизане от цикъла, дали търсената стойност е намерена или не. Изведете броя проверки “ти хикс ли си” на екран. 
Пуснете програмата над масив от букви – буквите от фамилното ви име, като търсите последователно дали стойностите а, б, в и г се намират вътре или не. 
Предавате програмен текст, вход и изход – снимка на екран.
*/
int main()
{
	setlocale(LC_ALL, "Bulgarian");
	char name[10] = { "Грамадова" };
	cout << name << endl << endl;
	// а, б, в и г
	char letters[5] = { "абвг" };
	unsigned counter = 0;
	
	for (int i = 0; i < 4; i++)
	{
		name[9] = letters[i];
		
		while (name[counter] != letters[i])
		{
			counter++;
		}
		if (counter != 9)
		{
			cout << "Yes, the letter " << letters[i] << " is found " << endl;
		}
		else {
            cout << "No, the letter " << letters[i] << " was NOT found " << endl;
		}
		counter = 0;
	}
	return 0;
}


